In [1]:
import requests
import json
from pandas import DataFrame
from matplotlib import pyplot

In [2]:
simple_json_url = "http://www.itpaper.co.kr/data/simple.json"

In [11]:
user_agent = "Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/96.0.4664.45 Safari/537.36"

header_info = {'user-agent': user_agent, 'referer': None}

In [12]:
r = requests.get(simple_json_url, headers=header_info)

if r.status_code != 200:
    err_msg = "%d %s 에러가 발생했습니다." % (r.status_code, r.reason)
    raise Exception(err_msg)

r.encoding = "utf-8"
r.text

'{\n    "name": "갤럭시 S6",\n    "type": "삼성",\n    "img": "http://itpaper.co.kr/demo/app/img/GalaxyS6.png"\n}'

In [13]:
result = json.loads(r.text)
result

{'name': '갤럭시 S6',
 'type': '삼성',
 'img': 'http://itpaper.co.kr/demo/app/img/GalaxyS6.png'}

In [15]:
#딕셔너리를 DataFrame으로 변환
data_list = [result]

simple_df = DataFrame(data_list)
simple_df

     name type                                             img
0  갤럭시 S6   삼성  http://itpaper.co.kr/demo/app/img/GalaxyS6.png

In [16]:
#리스트 형식의 데이터를 포함하는 json

#데이터 수집
json_list_url = "http://www.itpaper.co.kr/data/grade_card.json"

r = requests.get(json_list_url, headers=header_info)
if r.status_code != 200:
    err_msg = "%d %s 에러가 발생했습니다." % (r.status_code, r.reason)
    raise Exception(err_msg)

r.encoding = "utf-8"

result = json.loads(r.text)
result

{'grade_card': [{'이름': '철수',
   '학년': 1,
   '성별': '남자',
   '국어': 98,
   '영어': None,
   '수학': 88,
   '과학': 64},
  {'이름': '영희', '학년': 2, '성별': '여자', '국어': 88, '영어': 90, '수학': 62, '과학': 72},
  {'이름': '민수',
   '학년': 1,
   '성별': '남자',
   '국어': 92,
   '영어': 70,
   '수학': None,
   '과학': None},
  {'이름': '수현', '학년': 3, '성별': '여자', '국어': 63, '영어': 60, '수학': 31, '과학': 70},
  {'이름': '호영',
   '학년': 4,
   '성별': '남자',
   '국어': 120,
   '영어': 50,
   '수학': None,
   '과학': 88}]}

In [17]:
student_df = DataFrame(result['grade_card'])
student_df

   이름  학년  성별   국어    영어    수학    과학
0  철수   1  남자   98   NaN  88.0  64.0
1  영희   2  여자   88  90.0  62.0  72.0
2  민수   1  남자   92  70.0   NaN   NaN
3  수현   3  여자   63  60.0  31.0  70.0
4  호영   4  남자  120  50.0   NaN  88.0

In [18]:
성적표df = student_df.set_index('이름')
성적표df

    학년  성별   국어    영어    수학    과학
이름
철수   1  남자   98   NaN  88.0  64.0
영희   2  여자   88  90.0  62.0  72.0
민수   1  남자   92  70.0   NaN   NaN
수현   3  여자   63  60.0  31.0  70.0
호영   4  남자  120  50.0   NaN  88.0

In [19]:
성적표df2 = 성적표df.copy()
성적표df2['평균'] = 성적표df[성적표df.columns[2:]].mean(axis=1, skipna=True)
성적표df2

    학년  성별   국어    영어    수학    과학         평균
이름
철수   1  남자   98   NaN  88.0  64.0  83.333333
영희   2  여자   88  90.0  62.0  72.0  78.000000
민수   1  남자   92  70.0   NaN   NaN  81.000000
수현   3  여자   63  60.0  31.0  70.0  56.000000
호영   4  남자  120  50.0   NaN  88.0  86.000000